In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pickle

In [2]:
dataset = pd.read_csv('hiring.csv')

In [3]:
dataset.head()

  experience  test_score  interview  salary($)
0        NaN         8.0          9      50000
1        NaN         8.0          6      45000
2       five         6.0          7      60000
3        two        10.0         10      65000
4      seven         9.0          6      70000

In [4]:
dataset['experience'].fillna(0, inplace=True)

In [5]:
dataset['test_score'].fillna(dataset['test_score'].mean(), inplace=True)

In [6]:
dataset.head()

  experience  test_score  interview  salary($)
0          0         8.0          9      50000
1          0         8.0          6      45000
2       five         6.0          7      60000
3        two        10.0         10      65000
4      seven         9.0          6      70000

In [7]:
X = dataset.iloc[:, :3]

In [8]:
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}
    return word_dict[word]

In [9]:
X['experience'] = X['experience'].apply(lambda x : convert_to_int(x))

In [10]:
y = dataset.iloc[:, -1]

In [11]:
from sklearn.linear_model import LinearRegression
regressor = LinearRegression()

In [12]:
regressor.fit(X, y)

LinearRegression()

In [13]:
pickle.dump(regressor, open('model.pkl','wb'))

In [14]:
model = pickle.load(open('model.pkl','rb'))
print(model.predict([[2, 9, 6]]))

[53290.89255945]

In [15]:
dataset.head()

  experience  test_score  interview  salary($)
0          0         8.0          9      50000
1          0         8.0          6      45000
2       five         6.0          7      60000
3        two        10.0         10      65000
4      seven         9.0          6      70000